# Приведем список покупок в магазине

shop_list = ['Картофель', 'Горошек', 'Рис', 'Хлеб']

# Измените список согласно пунктам задания
# Выведите результат каждого пункта на консоль по очереди

# а. Вставьте рыбу между горошком и рисом

# b. Добавьте фрукты из списка fruits в конец списка shop_list
fruits = ['Яблоко', 'Апельсин', 'Клубника']

# c. Удалите из списка shop_list картофель

# d. Какими по счету стоят хлеб и апельсин? Выведите номера на консоль в формате:
#   Номер "продукта" в списке - N


#############################################################
# Ваши решения
#Даша Платонова
#a
shop_list.insert(2, 'Рыба')
print(shop_list)
#b
shop_list.extend(fruits)
print(shop_list)
#c
shop_list.remove('Картофель')
print(shop_list)
#d
print("Номер хлебушка в списке - ", shop_list.index('Хлеб') + 1)
print("Номер апельсинки в списке - ", shop_list.index('Апельсин') + 1)


#Богомолова Даша
shop_list.insert(2, 'Рыба')
print(shop_list) #a 

shop_list.extend(fruits)
print(shop_list) #b

shop_list.remove(shop_list[0])
print(shop_list) #c

print("Номер хлеба в списке - ", shop_list.index('Хлеб') + 1)
print("Номер апельсина в списке - ", shop_list.index('Апельсин') + 1) #d


# Василий Тимощенко
# а. 
shop_list.insert(2, 'Рыба')
print(shop_list)

# b. 
fruits = ['Яблоко', 'Апельсин', 'Клубника']
shop_list.extend(fruits)
print(shop_list)

# c. 
shop_list.remove('Картофель')
print(shop_list)

# d. 
print("Номер Хлеба в списке -", shop_list.index('Хлеб') + 1)
print("Номер Апельсина в списке -", shop_list.index('Апельсин') + 1)

#Новикова Екатерина
#a)
shop_list.insert(2, 'Рыба')
print(shop_list)
#b)
shop_list.extend(fruits)
print(shop_list)
#c)
shop_list.remove('Картофель')
print(shop_list)
#d)
x = shop_list.index('Хлеб')
y = shop_list.index('Апельсин')

print("Номер продукта в списке ", x)
print("Номер продукта в списке ", y)


shop_list.insert(2, 'Рыба')
print(shop_list)
#b
shop_list.extend(fruits)
print(shop_list)
#c
shop_list.remove('Картофель')гриша педикгриша педикгриша педикгриша педикгриша педикгриша педикгриша педикгриша педикгриша педикгриша педикгриша педикг
#Гуцкало Лиза
#a
shop_list.insert(2, 'Рыба')
print(shop_list)
#b
shop_list.extend(fruits)
print(shop_list)
#c
shop_list.pop(0)
print(shop_list)
#d
print('Номер Хлеба в списке -' ,shop_list.index('Хлеб')+1)
print('Номер Апельсина в списке -' ,shop_list.index('Апельсин')+1)

#Ильина Софья
# а
      shop_list.insert(2, 'Рыба')
      print(shop_list)
 # b
      fruits = ['Яблоко', 'Апельсин', 'Клубника']
      shop_list.extend(fruits)
      print(shop_list)
 # c
      shop_list.remove('Картофель')
      print(shop_list)

 # d
      print("Номер Хлеба в списке -", shop_list.index('Хлеб'))
      print("Номер Апельсина в списке -", shop_list.index('Апельсин'))

#Гусев Никитасев
shop_list.insert(2,'Рыба')
print(shop_list)
shop_list.extend(fruits)
print(shop_list) 
del shop_list[0]
print(shop_list)
a = 'Хлеб'
b = 'Апельсин'
print("Номер товара'" ,a, "'в списке", shop_list.index(a)+1)
print("Номер товара'" ,b, "'в списке", shop_list.index(b)+1)
4
tt
rtrterrttrtetree4ttretrt4ret
\ertrt4ttet4ee4tre4rrrtrrt4t4
while i!=100:4O)tiifjet4oe4e4rfjudvcvdmvd,vdf4tfew
  print()rr
print('Я УreКeРАЛ КОД У Jujik7')
i-=1i
ertrtfrfttrrr4ter4er4trfergerggtr4tter